cruzerngz/MDP_STM32/stm32/Core/Src/move.c
/*
 * move.c
 *
 *  Created on: Sep 1, 2022
 *      Author: jimmysqqr
 */

#include "stm32f4xx_hal.h"
#include "cmsis_os.h"
#include "math.h"
#include "stdlib.h"

#include "move.h"
#include "servo.h"
#include "motor.h"
#include "ir_adc.h"
#include "encoder.h"
#include "IMU_smooth.h"

#include "globals.h"

// private macros
#define MOVE_DELAY_TICKS 100
// TODO!
//  need a way to read instructions to stop
//  RPi command or boolean isStop() ??
#define TEST_MOVE_TIMER 800
#define MOTOR_ADJUST_SPEED 300 // TODO: to be tested

#define STRAIGHT_FORWARD_CONSTANT 57
#define STRAIGHT_BACKWARD_CONSTANT 55
#define TURN_FORWARD_CONSTANT 44
#define TURN_BACKWARD_CONSTANT 44

// private globals

//static
float MOTOR_INTEGRATION_SUM[2] = {0.0f}; // pid global
static float MOTOR_PREV_ERROR[2] = {0.0f}; // pid global
static float MOTOR_PREV_TICKS[2] = {0.0f}; // pid global

// internal state kept of the current outbound lane
// for the fastest car task
// so that the return trip is fully automated
static MoveDirection MOVE_F_OUTBOUND_LANE = MoveDirCenter;
static uint16_t MOVE_F_OBSTACLE_1_DISPLACEMENT = 0;
static uint16_t MOVE_F_OBSTACLE_2_DISPLACEMENT = 0;

// private function prototypes
void _pid_reset(uint32_t time_ticks);
void _pid_stop(MotorDirection dir, uint32_t speed_mm_s, uint32_t dist_mm);
void _move_in_direction_speed(MotorDirection dir, uint32_t speed_mm_s, uint32_t dist_mm, bool no_stop);

void _move_turn(MoveDirection move_dir, MotorDirection dir, uint32_t speed_mm_s, uint32_t degrees, bool no_stop);
void _move_turn_wide(MoveDirection move_dir, MotorDirection dir, uint32_t speed_mm_s, uint32_t degrees, bool no_stop); //wider turn ver

#define SERVO_FULL_LOCK_DELAY 450
#define DELAY_45 2650
#define DELAY_90 2650
#define DELAY_135 4500
#define DELAY_180 6000

/*
 * Start dynamic movement functions
 * Primary means of movement for car
 */

// Move the car forward by a specified distance, calculated
void move_forward_calc(uint32_t centimeters)
{
	servo_point_center();
	osDelay(100);
	motor_forward(MotorSpeed2);
	osDelay(57 * centimeters);

	motor_stop();
	servo_point_center();
}

// Move the car back by a specified distance, calculated
void move_backward_calc(uint32_t centimeters)
{
	servo_point_center();
	osDelay(100);
	motor_backward(MotorSpeed2);
	osDelay(55 * centimeters);

	motor_stop();
	servo_point_center();
}

/**
 * @brief Reset PID globals and sets the time to current
 *
 * @param time_ticks
 */
void _pid_reset(uint32_t time_ticks) {
	MOTOR_INTEGRATION_SUM[0] = 0.0f;
	MOTOR_INTEGRATION_SUM[1] = 0.0f;
	MOTOR_PREV_ERROR[0] = 0.0f;
	MOTOR_PREV_ERROR[1] = 0.0f;
	MOTOR_PREV_TICKS[0] = time_ticks;
	MOTOR_PREV_TICKS[1] = time_ticks;
}

// gradually bring the car to a stop - in (or less than) 640ms
// Reduces target speed linear
// pid reload freq up to 100 hz
void _pid_stop(MotorDirection dir, uint32_t speed_mm_s, uint32_t dist_mm) {
	uint32_t start_ticks = osKernelGetTickCount();
	uint32_t curr_ticks = 0;
	uint32_t iteration = 0; // out of 25
	uint32_t speed_subtract_amount = speed_mm_s >> 5; // div 32

	volatile uint32_t *ENCODER_LEFT;
	volatile uint32_t *ENCODER_RIGHT;
	uint32_t total_dist = 0;

	// _pid_reset(start_ticks);
	if(dir == MotorDirForward) {
		encoder_reset_counters_forward();
		ENCODER_LEFT = ENCODER_POS_DIRECTIONAL_FORWARD;
		ENCODER_RIGHT = ENCODER_POS_DIRECTIONAL_FORWARD + 1;
	}
	if(dir == MotorDirBackward) {
		encoder_reset_counters_backward();
		ENCODER_LEFT = ENCODER_POS_DIRECTIONAL_BACKWARD;
		ENCODER_RIGHT = ENCODER_POS_DIRECTIONAL_BACKWARD + 1;
	}

	do {
		curr_ticks = osKernelGetTickCount();

		taskENTER_CRITICAL();
		_set_motor_speed_pid(dir, MotorLeft, (uint32_t)speed_mm_s * MOVE_LEFT_MOTOR_MULTIPLIER * 1.025f);
		_set_motor_speed_pid(dir, MotorRight, speed_mm_s);
		total_dist = (*ENCODER_LEFT + *ENCODER_RIGHT) >> 1;
		taskEXIT_CRITICAL();

		speed_mm_s -= speed_subtract_amount; // linear decrease in target speed

		osDelayUntil(curr_ticks + 10); // 64 pid iterations at 100hz
	} while(curr_ticks - start_ticks < 320 || total_dist < dist_mm); // double stop conditions

	motor_stop();
}

// Internal move function
void _move_in_direction_speed(MotorDirection dir, uint32_t speed_mm_s, uint32_t dist_mm, bool no_stop) {
	servo_point_center();
	uint32_t time_ticks = osKernelGetTickCount();
	if(dist_mm < 100) speed_mm_s = speed_mm_s >> 1; // reduce speed for slow runs

	#ifdef MOVE_LOW_GRIP_SURFACE
	uint32_t target = (uint32_t)dist_mm;
	#else
	uint32_t target = (uint32_t)dist_mm;
	#endif

	volatile uint32_t *ENCODER_LEFT;
	volatile uint32_t *ENCODER_RIGHT;
	uint32_t total_dist = 0;

	_pid_reset(time_ticks);
	if(dir == MotorDirForward) {
		encoder_reset_counters_forward();
		ENCODER_LEFT = ENCODER_POS_DIRECTIONAL_FORWARD;
		ENCODER_RIGHT = ENCODER_POS_DIRECTIONAL_FORWARD + 1;
	}
	if(dir == MotorDirBackward) {
		encoder_reset_counters_backward();
		ENCODER_LEFT = ENCODER_POS_DIRECTIONAL_BACKWARD;
		ENCODER_RIGHT = ENCODER_POS_DIRECTIONAL_BACKWARD + 1;
	}

	do {
		time_ticks = osKernelGetTickCount();

		// int wheels_delta = *ENCODER_LEFT;

		taskENTER_CRITICAL();
		_set_motor_speed_pid(dir, MotorLeft, (uint32_t)speed_mm_s * MOVE_LEFT_MOTOR_MULTIPLIER);
		_set_motor_speed_pid(dir, MotorRight, speed_mm_s);
		total_dist = (*ENCODER_LEFT + *ENCODER_RIGHT) >> 1;
		taskEXIT_CRITICAL();
		osDelayUntil(time_ticks + MOVE_PID_LOOP_PERIOD_TICKS);
	} while(total_dist < target); // while still in delay loop

	if(no_stop == false) {motor_stop();}
}

// Internal turn function
void _move_turn(MoveDirection move_dir, MotorDirection dir, uint32_t speed_mm_s, uint32_t degrees, bool no_stop) {
	servo_point(move_dir, ServoMag5);
	if(degrees < 10) speed_mm_s = speed_mm_s >> 1;
	uint32_t time_ticks = osKernelGetTickCount();
	#ifdef MOVE_LOW_GRIP_SURFACE
	uint32_t target_dist_mm = degrees * MOVE_PID_TURN_OUTER_MM_PER_DEGREE * (1 + MOVE_PID_TURN_REDUCTION_FACTOR) * MOVE_PID_SLIP_MULTIPLIER;
	#else
	uint32_t target_dist_mm = degrees * MOVE_PID_TURN_OUTER_MM_PER_DEGREE * (1 + MOVE_PID_TURN_REDUCTION_FACTOR);

	#endif
	uint16_t left_motor_speed = move_dir == MoveDirLeft ? speed_mm_s * MOVE_PID_TURN_REDUCTION_FACTOR : speed_mm_s;
	uint16_t right_motor_speed = move_dir == MoveDirRight ? speed_mm_s * MOVE_PID_TURN_REDUCTION_FACTOR : speed_mm_s;
	volatile uint32_t *ENCODER_LEFT;
	volatile uint32_t *ENCODER_RIGHT;
	uint32_t total_dist = 0;

