cruzerngz/MDP_STM32/stm32/Core/Src/move.c
	_pid_reset(time_ticks);
	if(dir == MotorDirForward) {
		encoder_reset_counters_forward();
		ENCODER_LEFT = ENCODER_POS_DIRECTIONAL_FORWARD;
		ENCODER_RIGHT = ENCODER_POS_DIRECTIONAL_FORWARD + 1;
	}
	if(dir == MotorDirBackward) {
		encoder_reset_counters_backward();
		ENCODER_LEFT = ENCODER_POS_DIRECTIONAL_BACKWARD;
		ENCODER_RIGHT = ENCODER_POS_DIRECTIONAL_BACKWARD + 1;
	}

	if(no_stop == false) {osDelay(SERVO_FULL_LOCK_DELAY);}

	do {
		time_ticks = osKernelGetTickCount();

		taskENTER_CRITICAL();
		_set_motor_speed_pid(dir, MotorLeft, dir == MoveDirRight ? left_motor_speed * MOVE_OUTER_OVERDRIVE_RATIO : left_motor_speed);
		_set_motor_speed_pid(dir, MotorRight, dir == MoveDirLeft ? right_motor_speed * MOVE_OUTER_OVERDRIVE_RATIO : right_motor_speed);
		total_dist = *ENCODER_LEFT + *ENCODER_RIGHT;
		taskEXIT_CRITICAL();

		osDelayUntil(time_ticks + MOVE_PID_LOOP_PERIOD_TICKS);
	} while(total_dist < target_dist_mm);

	if(no_stop == false) {motor_stop();}
}


// Move a specified distance using the encoder
void move_forward_pid_cm(uint32_t centimeters, bool no_check)
{
	_move_in_direction_speed(MotorDirForward, MOVE_DEFAULT_SPEED_STRAIGHT_MM_S, centimeters * 10, no_check);

	if(no_check == false) {
		osDelay(MOVE_PID_LOOP_PERIOD_TICKS << 2);
		int32_t delta_cm = centimeters - (ENCODER_POS_DIRECTIONAL_FORWARD[0] + ENCODER_POS_DIRECTIONAL_FORWARD[1]) / 20;
		if(delta_cm < 0) _move_in_direction_speed(MotorDirBackward, MOVE_DEFAULT_SPEED_STRAIGHT_MM_S >> 1, abs(delta_cm * 10), false); //move_adjust_backward_pos_cm(abs(delta_cm));
		else if(delta_cm > 0) _move_in_direction_speed(MotorDirForward, MOVE_DEFAULT_SPEED_STRAIGHT_MM_S >> 1, delta_cm * 10, false); //move_adjust_forward_pos_cm(delta_cm);
	}
}

// Move a specified distance using the encoder
void move_backward_pid_cm(uint32_t centimeters, bool no_check)
{
	_move_in_direction_speed(MotorDirBackward, MOVE_DEFAULT_SPEED_STRAIGHT_MM_S, (uint32_t)centimeters * 10, false);

	if(no_check == false) {
		osDelay(MOVE_PID_LOOP_PERIOD_TICKS << 2);

		int32_t delta_cm = centimeters - (ENCODER_POS_DIRECTIONAL_BACKWARD[0] + ENCODER_POS_DIRECTIONAL_BACKWARD[1]) / 20;
		if(delta_cm < 0) _move_in_direction_speed(MotorDirForward, MOVE_DEFAULT_SPEED_STRAIGHT_MM_S >> 1, abs(delta_cm * 10), false); //move_adjust_backward_pos_cm(abs(delta_cm));
		else if(delta_cm > 0) _move_in_direction_speed(MotorDirBackward, MOVE_DEFAULT_SPEED_STRAIGHT_MM_S >> 1, delta_cm * 10, false); //move_adjust_forward_pos_cm(delta_cm);
	}
}

/**
 * @brief Uses servo mag 5 for turns (slightly tighter than previous implementation)
 * Turning circle (inner wheel to inner wheel, 180 degrees) approx 46cm
 * @param direction
 * @param degrees
 */
void move_turn_forward_pid_degrees(MoveDirection direction, uint16_t degrees, bool no_check) {
	// IMU_reset_yaw();
	_move_turn(direction, MotorDirForward, MOVE_DEFAULT_SPEED_TURN_MM_S, degrees, no_check);

	if(no_check == false) {
		osDelay(MOVE_PID_LOOP_PERIOD_TICKS);

		uint32_t outer_dist_travelled = direction == MoveDirLeft ? ENCODER_POS_DIRECTIONAL_FORWARD[1] : ENCODER_POS_DIRECTIONAL_FORWARD[0];
		uint32_t target_dist = (uint32_t)MOVE_PID_TURN_OUTER_MM_PER_DEGREE * degrees;

		int32_t delta = target_dist - outer_dist_travelled;
		int32_t delta_deg = delta / MOVE_PID_TURN_OUTER_MM_PER_DEGREE;



		// int32_t delta = (uint32_t) degrees - fabs(IMU_yaw);
		if(delta > 0) {
			_move_turn(direction, MotorDirForward, MOVE_DEFAULT_SPEED_TURN_MM_S >> 1, delta_deg, false);
		}
		if(delta < 0) {
			_move_turn(direction, MotorDirBackward, MOVE_DEFAULT_SPEED_TURN_MM_S >> 1, abs(delta_deg), false);
		}
	}

	servo_point_center();
}

/**
 * @brief Uses servo mag 5 for turns (slightly tighter than previous implenmentation)
 * Turning circle (inner wheel to inner wheel, 180 degrees) approx 46cm
 * @param direction
 * @param degrees
 */
void move_turn_backward_pid_degrees(MoveDirection direction, uint16_t degrees, bool no_check) {
	_move_turn(direction, MotorDirBackward, MOVE_DEFAULT_SPEED_TURN_MM_S, degrees, no_check);

	if(no_check == false) {
		osDelay(MOVE_PID_LOOP_PERIOD_TICKS);
		uint32_t outer_dist_travelled = direction == MoveDirLeft ? ENCODER_POS_DIRECTIONAL_BACKWARD[1] : ENCODER_POS_DIRECTIONAL_BACKWARD[0];
		uint32_t target_dist = (uint32_t)MOVE_PID_TURN_OUTER_MM_PER_DEGREE * degrees * MOVE_PID_SLIP_MULTIPLIER;
		int32_t delta = target_dist - outer_dist_travelled;
		int32_t delta_deg = delta / MOVE_PID_TURN_OUTER_MM_PER_DEGREE;

		// int32_t delta = (uint32_t) degrees - fabs(IMU_yaw);
		if(delta > 0) {
			_move_turn(direction, MotorDirBackward, MOVE_DEFAULT_SPEED_TURN_MM_S >> 1, delta_deg, false);
		}
		if(delta < 0) {
			_move_turn(direction, MotorDirForward, MOVE_DEFAULT_SPEED_TURN_MM_S >> 1, abs(delta_deg), false);
		}
	}

	servo_point_center();
}

// Move the car forward AND turn it to a specified angle
void move_turn_forward_by(MoveDirection direction, uint16_t degrees)
{
	servo_point(direction, ServoMag4);
	osDelay(SERVO_FULL_LOCK_DELAY);
	motor_forward(MotorSpeed2);
	osDelay(46 * degrees);
	motor_stop();
	servo_point_center();
}

// Move the car backward AND turn it to a specified angle
void move_turn_backward_by(MoveDirection direction, uint16_t degrees)
{
	servo_point(direction, ServoMag4);
	osDelay(SERVO_FULL_LOCK_DELAY);
	motor_backward(MotorSpeed2);
	osDelay(46 * degrees);
	motor_stop();
	servo_point_center();
}

// Perform an in-place turn, starting with a direction (forward/backward)
//
void move_in_place_turn_by(MoveDirection direction, uint16_t degrees)
{
}

// Perform an in place turn by a multiple of 22.5 degrees, 0-indexed
// Starts by moving backwards first
// E.g. cardinal_direction=4 performs a 90 degree in-place turn, clockwise
// E.g. cardinal_direction=12 performs a 90 degree in-place turn, anticlockwise
void move_in_place_turn_cardinal(uint8_t cardinal_direction)
{
	// convert clockwise multiples of 22.5 degrees
	// to pos-neg multiples of 22.5 degrees (-8 to +7)
	cardinal_direction = cardinal_direction % 16; // wrap to 0-15
	// actual turn action, -8 to +7
	int8_t num_turns = cardinal_direction > 7 ? 16 - cardinal_direction : cardinal_direction;
	// exec clockwise (1) or anticlockwise (0)s
	uint8_t clockwise = cardinal_direction <= 7 ? 1 : 0; // clockwise if less than 7

	MoveDirection rev_dir = clockwise ? MoveDirLeft : MoveDirRight;
	MoveDirection for_dir = clockwise ? MoveDirRight : MoveDirLeft;

	if(cardinal_direction == 4 || cardinal_direction == 12) {
        move_forward_pid_cm(25, false);
        // move_forward_pid_cm(5);
		osDelay(MOVE_PID_LOOP_PERIOD_TICKS);

        for (uint8_t i = 0; i < 2; i++)
        {
            move_turn_backward_pid_degrees(rev_dir, 22, false);
            osDelay(MOVE_PID_LOOP_PERIOD_TICKS);
            move_turn_forward_pid_degrees(for_dir, 22, false);
            osDelay(MOVE_PID_LOOP_PERIOD_TICKS);
        }

